In [6]:
areas = ['HR', 'Designing', 'Managment', 'Information Technology',
       'Education', 'Advocate', 'Business Development',
       'Health & Fitness', 'Agricultural', 'BPO', 'Sales', 'Consultant',
       'Digital Media', 'Building & Construction', 'Automobile',
       'Banking', 'Engineering', 'Food & Beverages', 'Finance', 'Apparel',
       'Accountant', 'Architects', 'Public Relations', 'Arts', 'Aviation', 'Others']

In [2]:
import pandas as pd

In [7]:
df = pd.DataFrame(areas)

In [8]:
df

                          0
0                        HR
1                 Designing
2                 Managment
3    Information Technology
4                 Education
5                  Advocate
6      Business Development
7          Health & Fitness
8              Agricultural
9                       BPO
10                    Sales
11               Consultant
12            Digital Media
13  Building & Construction
14               Automobile
15                  Banking
16              Engineering
17         Food & Beverages
18                  Finance
19                  Apparel
20               Accountant
21               Architects
22         Public Relations
23                     Arts
24                 Aviation
25                   Others

In [14]:
df.to_csv(index=False, path_or_buf = '../data_base/csv/work_areas.csv')

In [11]:
i = [i for i in range(26)]

In [12]:
i

[0,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25]

In [15]:
import random
id_work_area = random.choices(i,k=2000)

In [17]:
i = [i for i in range(2000)]
id_job_offer = pd.DataFrame(i)

In [18]:
id_job_offer['id_work_area'] = id_work_area

In [19]:
id_job_offer

         0  id_work_area
0        0            17
1        1            13
2        2            13
3        3            12
4        4            14
...    ...           ...
1995  1995            24
1996  1996            25
1997  1997             7
1998  1998            14
1999  1999             6

[2000 rows x 2 columns]

In [24]:
id_job_offer.sample()

     id_user  id_work_area
204      204             0

In [23]:
id_job_offer.rename(columns={'id_job_offer':'id_user'}, inplace=True)

In [22]:
id_job_offer.to_csv(index=False, path_or_buf = '../data_base/csv/work_area_jobs.csv')